Revit 2027 API
Material.IsNameUnique Method
 Validates whether the material name is unique in document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNameUnique(
	Document aDocument,
	string name
)
Public Shared Function IsNameUnique (
	aDocument As Document,
	name As String
) As Boolean
public:
static bool IsNameUnique(
	Document^ aDocument,
	String^ name
)
static member IsNameUnique :
        aDocument : Document *
        name : string -> bool
Parameters
aDocument Document
 The document in which the name is being tested for uniqueness.
name String
 The name tested for uniqueness.
Return Value
Boolean
 Returns true if the name is unique, and false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace